# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-l object detection model with P3-P5 outputs. For details see https://docs.ultralytics.com/models/rtdetr

# Parameters
nc: 1 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, HGStem, [32, 48]] # 0-P2/4
  - [-1, 6, HGBlock, [48, 128, 3]] # stage 1

  - [-1, 1, DWConv, [128, 3, 2, 1, False]] # 2-P3/8
  - [-1, 6, HGBlock, [96, 512, 3]] # stage 2

  - [-1, 1, DWConv, [512, 3, 2, 1, False]] # 4-P4/16
  - [-1, 6, HGBlock, [192, 1024, 5, True, False]] # cm, c2, k, light, shortcut
  - [-1, 6, HGBlock, [192, 1024, 5, True, True]]
  - [-1, 6, HGBlock, [192, 1024, 5, True, True]] # stage 3

  - [-1, 1, DWConv, [1024, 3, 2, 1, False]] # 8-P5/32
  - [-1, 6, HGBlock, [384, 2048, 5, True, False]] # stage 4

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 10 input_proj.2
  - [-1, 1, AIFI, [1024, 8]]
  - [-1, 1, Conv, [256, 1, 1]] # 12, Y5, lateral_convs.0

  - [3, 1, Conv, [256]]  # 13-P3/8
  - [7, 1, Conv, [256]]  # 14-P4/16
  - [12, 1, Conv, [256]]  # 15-P5/32

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 16 P5->P4
  - [[-1, 14], 1, BiFPN, []] # 17
  - [-1, 3, RepC3, [256]] # 18-P4/16
  
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 19 P4->P3
  - [[-1, 13], 1, BiFPN, []] # 20
  - [-1, 3, RepC3, [256]] # 21-P3/8

  - [1, 1, Conv, [256, 3, 2]] # 22 P2->P3
  - [[-1, 13, 21], 1, BiFPN, []] # 23
  - [-1, 3, RepC3, [256]] # 24-P3/8

  - [-1, 1, Conv, [256, 3, 2]] # 25 P3->P4
  - [[-1, 14, 18], 1, BiFPN, []] # 26
  - [-1, 3, RepC3, [256]] # 27-P4/16

  - [-1, 1, Conv, [256, 3, 2]] # 28 P4->P5
  - [[-1, 15], 1, BiFPN, []] # 29
  - [-1, 3, RepC3, [256]] # 30-P5/32

  - [[24, 27, 30], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]  # Detect(P3, P4, P5)
