# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-l object detection model with P3-P5 outputs. For details see https://docs.ultralytics.com/models/rtdetr

# Parameters
nc: 1 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, HGStem, [32, 48]] # 0-P2/4
  - [-1, 6, HGBlock, [48, 128, 3]] # stage 1

  - [-1, 1, DWConv, [128, 3, 2, 1, False]] # 2-P3/8
  - [-1, 6, HGBlock, [96, 512, 3]] # stage 2

  - [-1, 1, DWConv, [512, 3, 2, 1, False]] # 4-P4/16
  - [-1, 6, HGBlock, [192, 1024, 5, True, False]] # cm, c2, k, light, shortcut
  - [-1, 6, HGBlock, [192, 1024, 5, True, True]]
  - [-1, 6, HGBlock, [192, 1024, 5, True, True]] # stage 3

  - [-1, 1, DWConv, [1024, 3, 2, 1, False]] # 8-P5/32
  - [-1, 6, HGBlock, [384, 2048, 5, True, False]] # stage 4

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 10 input_proj.2
  - [-1, 1, AIFI, [1024, 8]] # 11
  - [-1, 1, Conv, [256, 1, 1]]  # 12, Y5, lateral_convs.0

  - [[1, 3, 7, 9], 1, SimFusion_4in, []] # 13
  - [-1, 1, IFM, [[64, 32]]] # 14

  - [12, 1, Conv, [256, 1, 1]] # 15
  - [[3, 7, -1], 1, SimFusion_3in, [256]] # 16
  - [[-1, 14], 1, InjectionMultiSum_Auto_pool, [256, [64, 32], 0]] # 17
  - [-1, 3, RepC3, [256]] # 18

  - [7, 1, Conv, [256, 1, 1]] # 19
  - [[1, 3, -1], 1, SimFusion_3in, [256]] # 20
  - [[-1, 14], 1, InjectionMultiSum_Auto_pool, [256, [64, 32], 1]] # 21
  - [-1, 3, RepC3, [256]] # 22

  - [[18, 18, 12], 1, PyramidPoolAgg, [352, 2]] # 23
  - [-1, 1, TopBasicLayer, [352, [64, 128]]] # 24

  - [[22, 19], 1, AdvPoolFusion, []] # 25
  - [[-1, 24], 1, InjectionMultiSum_Auto_pool, [256, [64, 128], 0]] # 26
  - [-1, 3, RepC3, [256]] # 27

  - [[-1, 15], 1, AdvPoolFusion, []] # 28
  - [[-1, 24], 1, InjectionMultiSum_Auto_pool, [256, [64, 128], 1]] # 29
  - [-1, 3, RepC3, [256]] # 30

  - [[22, 27, 30], 1, RTDETRDecoder, [nc]] # 31
