# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-ResNet50 object detection model with P3-P5 outputs.

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]
 
backbone:
  # [from, repeats, module, args]
  - [-1, 1, ConvNormLayer, [32, 3, 2, 1, 'relu']] # 0-P1
  - [-1, 1, ConvNormLayer, [32, 3, 1, 1, 'relu']] # 1
  - [-1, 1, ConvNormLayer, [64, 3, 1, 1, 'relu']] # 2
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] # 3-P2
 
 
  - [-1, 2, Blocks, [64,  BasicBlock, 2, False]] # 4
  - [-1, 2, Blocks, [128, BasicBlock, 3, False]] # 5-P3
  - [-1, 2, Blocks, [256, BasicBlock, 4, False]] # 6-P4
  - [-1, 2, Blocks, [512, BasicBlock, 5, False]] # 7-P5
 
head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 8 input_proj.2
  - [-1, 1, AIFI, [1024, 8]] # 9
  - [-1, 1, Conv, [256, 1, 1]]  # 10, Y5, lateral_convs.0

  - [6, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 11 input_proj.1
  - [[-1, -2], 1, WFU, []] # 12
  - [-1, 3, RepC3, [256, 0.5]]  # 13, fpn_blocks.0
  - [-1, 1, Conv, [256, 1, 1]]   # 14, Y4, lateral_convs.1

  - [5, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 15 input_proj.0
  - [[-1, -2], 1, WFU, []]  # 16 cat backbone P4
  - [-1, 3, RepC3, [256, 0.5]]    # X3 (17), fpn_blocks.1

  - [-1, 1, Conv, [256, 3, 2]]   # 18, downsample_convs.0
  - [[-1, 14], 1, Concat, [1]]  # 19 cat Y4
  - [-1, 3, RepC3, [256, 0.5]]    # F4 (20), pan_blocks.0

  - [-1, 1, Conv, [256, 3, 2]]   # 21, downsample_convs.1
  - [[-1, 10], 1, Concat, [1]]  # 22 cat Y5
  - [-1, 3, RepC3, [256, 0.5]]    # F5 (23), pan_blocks.1

  - [[17, 20, 23], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]  # Detect(P3, P4, P5)


