# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-l object detection model with P3-P5 outputs. For details see https://docs.ultralytics.com/models/rtdetr

# Parameters
nc: 1 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, HGStem, [32, 48]] # 0-P2/4
  - [-1, 6, HGBlock, [48, 128, 3]] # stage 1

  - [-1, 1, DWConv, [128, 3, 2, 1, False]] # 2-P3/8
  - [-1, 6, HGBlock, [96, 512, 3]] # stage 2

  - [-1, 1, DWConv, [512, 3, 2, 1, False]] # 4-P4/16
  - [-1, 6, HGBlock_AssemFormer, [192, 1024, 5, True, False]] # cm, c2, k, light, shortcut
  - [-1, 6, HGBlock_AssemFormer, [192, 1024, 5, True, True]]
  - [-1, 6, HGBlock_AssemFormer, [192, 1024, 5, True, True]] # stage 3

  - [-1, 1, DWConv, [1024, 3, 2, 1, False]] # 8-P5/32
  - [-1, 6, HGBlock, [384, 2048, 5, True, False]] # stage 4

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 10 input_proj.2
  - [-1, 1, AIFI, [1024, 8]] # 11
  - [-1, 1, Conv, [256, 1, 1]]  # 12, Y5, lateral_convs.0

  - [-1, 1, ChannelAttention_HSFPN, []] # 13
  - [-1, 1, nn.Conv2d, [256, 1]] # 14
  - [-1, 1, nn.ConvTranspose2d, [256, 3, 2, 1, 1]] # 15

  - [7, 1, ChannelAttention_HSFPN, []] # 16
  - [-1, 1, nn.Conv2d, [256, 1]] # 17
  - [15, 1, ChannelAttention_HSFPN, [4, False]] # 18
  - [[-1, -2], 1, Multiply, []] # 19
  - [[-1, 15], 1, Add, []] # 20
  - [-1, 3, RepC3, [256]] # 21 P4/16

  - [15, 1, nn.ConvTranspose2d, [256, 3, 2, 1, 1, 16]] # 22
  - [3, 1, ChannelAttention_HSFPN, []] # 23
  - [-1, 1, nn.Conv2d, [256, 1]] # 24
  - [22, 1, ChannelAttention_HSFPN, [4, False]] # 25
  - [[-1, -2], 1, Multiply, []] # 26
  - [[-1, 22], 1, Add, []] # 27
  - [-1, 3, RepC3, [256]] # 28 P3/8

  - [[28, 21, 14], 1, RTDETRDecoder, [nc]]  # Detect(P3, P4, P5)

